app/controllers/api/assets_controller.rb

    def index
        @assets = Asset.order('ticker ASC')
---
SELECT "assets".* FROM "assets" ORDER BY ticker DESC

    def show
        # @asset = Asset.find_by(id: params[:id])
        # debugger
        @asset = Asset.find_by(ticker: params[:ticker].upcase)
---
SELECT  "assets".* FROM "assets" WHERE "assets"."ticker" = $1 LIMIT $2  [["ticker", "BSV"], ["LIMIT", 1]]

    def update
        @asset = Asset.find(params[:id])
---
SELECT  "assets".* FROM "assets" WHERE "assets"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def destroy
        @asset = Asset.find_by(id: params[:id])
        @asset.destroy
---
SELECT  "assets".* FROM "assets" WHERE "assets"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "assets" WHERE "assets"."id" = $1  [["id", 7]]