app/controllers/api/histories_controller.rb

SELECT "histories".* FROM "histories" WHERE "histories"."user_id" = $1  [["user_id", 46]]
---
    def index
        # @histories = History.where(user_id: current_user.id)
        @histories = History.where(user_id: 46)