app/controllers/api/holdings_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]
---
    def index
        @current_user_id = current_user ? current_user.id : 46
        @current_user = current_user ? current_user : User.find(46)