app/controllers/api/portfolios_controller.rb

    def index
        # @current_user_id = current_user ? current_user.id : 46
        @current_user = current_user || User.find(46)
        @portfolio_data = Portfolio.where(user_id: @current_user.id).last
---
SELECT  "portfolios".* FROM "portfolios" WHERE (user_id = 46) ORDER BY "portfolios"."id" DESC LIMIT $1  [["LIMIT", 1]]