app/controllers/api/transactions_controller.rb

    def create
        @transaction_qt = transaction_params["quantity"].to_i
        @records = []
        @current_user_id = params[:user_id]

        if ["Deposit", "Withdraw"].include?(params[:transaction_type])
            @bank_trans = Transaction.new(transaction_params)
            if @bank_trans.save
                case params[:transaction_type]
                when "Deposit"
                    last_cash_balance = !Portfolio.where(user_id: @current_user_id).empty? ? Portfolio.where(user_id: @current_user_id).last.balance : 0
                    @portfo_record = Portfolio.new({
                        user_id: @current_user_id,
                        balance: last_cash_balance += @bank_trans.transaction_amount
                    })
                    @portfo_record.save!
                when  "Withdraw"
                    last_cash_balance = Portfolio.where(user_id: @current_user_id).last.balance
                    @portfo_record = Portfolio.new({
                        user_id: @current_user_id,
                        balance: last_cash_balance -= @bank_trans.transaction_amount
                    })
                    @portfo_record.save!
                else
                    "Not a valid trans type"
                end
            end
            render :bank_index
        else
            last_cash_balance = Portfolio.where(user_id: @current_user_id).last.balance
            params[:transaction_amount] = (params[:quantity].to_i * params[:cost_per_share].to_i).to_s

            History.create(transaction_params)
---
INSERT INTO "transactions" ("user_id", "transaction_type", "created_at", "updated_at", "transaction_amount") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 46], ["transaction_type", "Deposit"], ["created_at", "2020-09-22 18:29:37.791322"], ["updated_at", "2020-09-22 18:29:37.791322"], ["transaction_amount", 10000.0]]
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 ORDER BY "portfolios"."id" DESC LIMIT $2  [["user_id", 46], ["LIMIT", 1]]
SELECT  1 AS one FROM "portfolios" WHERE "portfolios"."user_id" = $1 LIMIT $2  [["user_id", 46], ["LIMIT", 1]]
INSERT INTO "portfolios" ("user_id", "balance", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 46], ["balance", 10000.0], ["created_at", "2020-09-22 18:29:37.832837"], ["updated_at", "2020-09-22 18:29:37.832837"]]
INSERT INTO "portfolios" ("user_id", "balance", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 46], ["balance", 2876.0], ["date", "2020-09-17 20:07:32.173104"], ["created_at", "2020-09-17 20:07:32.173751"], ["updated_at", "2020-09-17 20:07:32.173751"]]
INSERT INTO "histories" ("user_id", "ticker", "transaction_type", "transaction_amount", "quantity", "cost_per_share", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"


            case params[:transaction_type]
            when "Buy"
                Portfolio.create({
                    user_id: @current_user_id,
                    balance: last_cash_balance -= params[:transaction_amount].to_i
                })
            when "Sell"
                Portfolio.create({
                    user_id: @current_user_id,
                    balance: last_cash_balance += params[:transaction_amount].to_i
                })
---
INSERT INTO "portfolios" ("user_id", "balance", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 46], ["balance", 2676.0], ["date", "2020-09-17 20:38:15.644536"], ["created_at", "2020-09-17 20:38:15.645070"], ["updated_at", "2020-09-17 20:38:15.645070"]]
INSERT INTO "portfolios" ("user_id", "balance", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 46], ["balance", 2176.0], ["created_at", "2020-09-20 01:49:43.568099"], ["updated_at", "2020-09-20 01:49:43.568099"]]

            end

            @records.each do |transaction_obj|
                if !transaction_obj.save
                    return
                end
            end
            @saved_records = Transaction.last(@records.length)
---
UPDATE "transactions" SET "transaction_amount" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["transaction_amount", 200.0], ["updated_at", "2020-09-17 20:38:15.637645"], ["id", 76]]
INSERT INTO "transactions" ("user_id", "transaction_type", "created_at", "updated_at", "quantity", "cost_per_share", "transaction_amount", "ticker") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "transactions".* FROM "transactions" ORDER BY "transactions"."id" DESC LIMIT $1  [["LIMIT", 3]]