app/controllers/api/transactions_controller.rb

UPDATE "transactions" SET "transaction_amount" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["transaction_amount", 200.0], ["updated_at", "2020-09-17 20:38:15.637645"], ["id", 76]]
---
    def save
        if self.is_a?(Array)
            if self.all? { |transaction| transaction.save }