app/controllers/api/transactions_controller.rb

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 ORDER BY "portfolios"."id" DESC LIMIT $2  [["user_id", 46], ["LIMIT", 1]]
INSERT INTO "transactions" ("user_id", "transaction_type", "created_at", "updated_at", "quantity", "cost_per_share", "transaction_amount", "ticker") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def dice_and_save_delete
        if @transaction_record.save
            case @transaction_record.transaction_type
            when "Buy"
                last_cash_balance = Portfolio.where(user_id: @current_user_id).last.balance
                @transaction_record.update(transaction_amount: @transaction_record.quantity * @transaction_record.cost_per_share)

                Portfolio.create({
                    user_id: @current_user_id,
                    balance: last_cash_balance -= @transaction_record.transaction_amount,
                    date: DateTime.now()
                })