app/controllers/api/users_controller.rb

    def create
        @current_user = current_user
        rand_tickers = ["GOOGL", "FB", "TWTR", "GE", "AAPL", "NFLX", "STNG"]
        rand_sample = rand_tickers.sample
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "firstName", "lastName", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"