app/controllers/api/watchlists_controller.rb

    def destroy
        @watchlist_asset = Watchlist.find_by(ticker: params[:ticker], user_id: params[:user_id])
        if @watchlist_asset
            @watchlist_asset.destroy
---
DELETE FROM "watchlists" WHERE "watchlists"."id" = $1  [["id", 112]]