app/controllers/api/watchlists_controller.rb

    def index
        @current_user = current_user || User.find_by(firstName: "Demo")
        @watchlist_assets =  Watchlist.where('user_id = ?', @current_user.id)
        holdings = @current_user.holdings
        @ordered = []

        @watchlist_assets.each do |record|
---
SELECT  "watchlists".* FROM "watchlists" WHERE (user_id = 46) LIMIT $1  [["LIMIT", 11]]
SELECT "watchlists".* FROM "watchlists" WHERE (user_id = 46)

    def show
        @watchlist_asset = Watchlist.find_by(ticker: params[:ticker])
---
SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."ticker" IS NULL LIMIT $1  [["LIMIT", 1]]

    def create
        if !Watchlist.exists?(ticker: params[:ticker], user_id: params[:user_id])
            @watchlist_asset = Watchlist.new(watchlist_params)
            # debugger
                # @watchlist_asset.asset_id = Asset.where(ticker: watchlist_params[:ticker]).first.id
                if @watchlist_asset.save
                    debugger
                    @current_user = current_user || User.find_by(firstName: "Demo")
                    @watchlist_assets =  Watchlist.where('user_id = ?', @current_user.id)
---
SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."ticker" = $1 AND "watchlists"."user_id" = $2 LIMIT $3  [["ticker", "TSLA"], ["user_id", 46], ["LIMIT", 1]]
SELECT  1 AS one FROM "watchlists" WHERE "watchlists"."ticker" = $1 AND "watchlists"."user_id" = $2 LIMIT $3  [["ticker", "FB"], ["user_id", 46], ["LIMIT", 1]]
INSERT INTO "watchlists" ("created_at", "updated_at", "ticker", "asset_name", "latest_price", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2020-09-13 04:49:26.083570"], ["updated_at", "2020-09-13 04:49:26.083570"], ["ticker", "GOOGL"], ["asset_name", "Alphabet, Inc."], ["latest_price", 1519.0], ["user_id", 46]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]
SELECT  "watchlists".* FROM "watchlists" WHERE (user_id = 46) LIMIT $1  [["LIMIT", 11]]

    def destroy
        @watchlist_asset = Watchlist.find_by(ticker: params[:ticker], user_id: params[:user_id])
        if @watchlist_asset
            @watchlist_asset.destroy
---
SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."ticker" = $1 AND "watchlists"."user_id" = $2 LIMIT $3  [["ticker", "TSLA"], ["user_id", 46], ["LIMIT", 1]]
DELETE FROM "watchlists" WHERE "watchlists"."id" = $1  [["id", 72]]