app/models/user.rb

    def holdings_between(prev, cur, initial=false)
        # @current_user = current_user ? current_user : User.find(46)
        @current_user = User.find(46) || User.find_by(firstName: "Demo")

        holdings_snapshot = initial ? Hash.new(0) : @current_user.holdings
        buys = self.transaction_records.where(transaction_type: "Buy", created_at: prev..cur).to_a
        sells = self.transaction_records.where(transaction_type: "Sell", created_at: prev..cur).to_a
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 AND "transactions"."transaction_type" = $2  [["user_id", 46], ["transaction_type", "Buy"]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 AND "transactions"."transaction_type" = $2  [["user_id", 46], ["transaction_type", "Sell"]]